```json
{
  "word": "overload",
  "definitions": [
    {
      "meaning": "to give or place too much of something, such as work, weight, or information, causing strain or overwhelm",
      "usage": "Used as a verb to describe the act of placing excessive demands or quantities on a person, system, or object, often leading to inefficiency or breakdown. Can also be used as a noun to refer to the excessive load itself.",
      "collocations": ["overload with work", "overload the system", "information overload"],
      "examples": [
        {
          "scene": "在一个繁忙的办公室里，张伟是一名项目经理，最近公司接了一个大项目，他和他的团队每天加班到深夜。他感到压力巨大，因为任务量远远超出了他们的承受能力。",
          "chineseIdea": "张伟觉得自己被工作压得喘不过气，任务多到让他无法应对，甚至影响了他的健康。",
          "sentenceWithBlank": "The manager @ @ @, causing the team to feel overwhelmed.",
          "fullEnglishSentence": "The manager 「overloaded them with work」, causing the team to feel overwhelmed.",
          "chineseTranslation": "经理「给他们分配了过多工作」，导致团队感到不堪重负。",
          "chinglishFix": "Chinglish: The manager gave them too many works. Correct: The manager overloaded them with work."
        },
        {
          "scene": "李梅是一名大学生，她正在准备期末考试，同时还要完成三门课程的论文。她每天花十几个小时学习，试图记住所有内容，但感觉头脑一片迷雾。",
          "chineseIdea": "李梅觉得自己吸收了太多信息，大脑已经处理不过来，甚至开始忘记之前学过的知识。",
          "sentenceWithBlank": "Trying to study everything at once led to @ @.",
          "fullEnglishSentence": "Trying to study everything at once led to 「information overload」.",
          "chineseTranslation": "试图同时学习所有内容导致了「信息超载」。",
          "chinglishFix": "Chinglish: Her brain was too full of information. Correct: She experienced information overload."
        }
      ]
    },
    {
      "meaning": "to put too much electrical current or power through a circuit or device, causing it to malfunction or fail",
      "usage": "Used as a verb in technical contexts, particularly with electrical systems or machinery, to describe exceeding the capacity of a circuit or device. As a noun, it refers to the excessive electrical load.",
      "collocations": ["overload the circuit", "overload a device", "prevent overload"],
      "examples": [
        {
          "scene": "在一个老旧的公寓里，王强正在使用电暖器、微波炉和电水壶。因为这些电器同时运行，公寓的电路系统不堪重负，最终跳闸了。",
          "chineseIdea": "王强没有意识到同时使用这么多高功率电器会让电路超出负荷，导致停电。",
          "sentenceWithBlank": "Using multiple appliances at once can @ @ @.",
          "fullEnglishSentence": "Using multiple appliances at once can 「overload the circuit」.",
          "chineseTranslation": "同时使用多个电器可能会「使电路超载」。",
          "chinglishFix": "Chinglish: The electricity was too much for the circuit. Correct: The circuit was overloaded."
        },
        {
          "scene": "在一家工厂里，工人们正在测试一台新机器。他们不小心让机器以超出设计功率的模式运行，结果机器过热，停止工作。",
          "chineseIdea": "工人们试图让机器超负荷运行，以测试其极限，但这导致机器损坏。",
          "sentenceWithBlank": "Running the machine at full capacity may @ @ @.",
          "fullEnglishSentence": "Running the machine at full capacity may 「overload a device」.",
          "chineseTranslation": "以最大功率运行机器可能会「使设备超载」。",
          "chinglishFix": "Chinglish: The machine was given too much power. Correct: The device was overloaded."
        }
      ]
    }
  ]
}
```