{
  "word": "forefinger",
  "definitions": [
    {
      "meaning": "The finger next to the thumb, also known as the index finger, typically used for pointing or pressing.",
      "usage": "Refers to the second finger of the hand, commonly used in gestures like pointing, pressing buttons, or indicating something specific.",
      "collocations": ["point with", "press with", "tap with", "gesture with"],
      "examples": [
        {
          "scene": "在一个教室里，老师正在讲解一幅地图，学生们聚精会神地听讲。老师需要指出地图上的某个国家。",
          "chineseIdea": "用手指指向某个具体位置，帮助别人理解或注意某个事物。",
          "sentenceWithBlank": "The teacher @ @ the map to show the location of Brazil.",
          "fullEnglishSentence": "The teacher 「pointed with her forefinger」 at the map to show the location of Brazil.",
          "chineseTranslation": "老师「用食指指向」地图，展示巴西的位置。",
          "chinglishFix": "Chinglish: The teacher use finger point map. Correction: The teacher pointed at the map with her forefinger."
        },
        {
          "scene": "在咖啡店里，一个顾客正在使用自助点餐机，但屏幕反应有点慢，需要轻触屏幕来选择选项。",
          "chineseIdea": "用手指轻触某个表面，比如屏幕或按钮，以触发某种动作。",
          "sentenceWithBlank": "The customer @ @ the screen to select her coffee order.",
          "fullEnglishSentence": "The customer 「tapped with her forefinger」 on the screen to select her coffee order.",
          "chineseTranslation": "顾客「用食指轻触」屏幕来选择她的咖啡订单。",
          "chinglishFix": "Chinglish: The customer touch screen with finger. Correction: The customer tapped the screen with her forefinger."
        }
      ]
    },
    {
      "meaning": "The forefinger used in specific cultural or symbolic gestures, such as indicating direction or emphasis.",
      "usage": "Used in gestures that carry cultural or contextual meaning, such as beckoning, warning, or emphasizing a point in conversation.",
      "collocations": ["wag the", "raise the", "beckon with"],
      "examples": [
        {
          "scene": "在一个家庭聚会上，妈妈正在提醒孩子不要吃太多甜点，语气中带着一点责备。",
          "chineseIdea": "通过晃动手指来表达警告或提醒，通常带有教育或责备的语气。",
          "sentenceWithBlank": "Mom @ @ @ at her son, warning him about too many sweets.",
          "fullEnglishSentence": "Mom 「wagged the forefinger」 at her son, warning him about too many sweets.",
          "chineseTranslation": "妈妈「晃动食指」对着儿子，警告他不要吃太多甜食。",
          "chinglishFix": "Chinglish: Mom shake finger to son. Correction: Mom wagged her forefinger at her son."
        },
        {
          "scene": "在一个热闹的集市上，一个摊主想吸引远处的一个顾客过来查看他的商品。",
          "chineseIdea": "用手指做出召唤的动作，吸引某人的注意并邀请他们靠近。",
          "sentenceWithBlank": "The vendor @ @ to invite the customer closer.",
          "fullEnglishSentence": "The vendor 「beckoned with his forefinger」 to invite the customer closer.",
          "chineseTranslation": "摊主「用食指招手」邀请顾客靠近。",
          "chinglishFix": "Chinglish: The vendor wave finger to customer. Correction: The vendor beckoned with his forefinger to the customer."
        }
      ]
    }
  ]
}
