{
  "word": "citizen",
  "definitions": [
    {
      "meaning": "A legally recognized member of a country or state, with associated rights and responsibilities",
      "usage": "Refers to an individual who is part of a nation or state, often with rights like voting and responsibilities like paying taxes. Commonly used in legal, political, or civic contexts.",
      "collocations": ["active citizen", "law-abiding citizen", "global citizen"],
      "examples": [
        {
          "scene": "在一个社区会议上，居民们聚集在一起讨论如何改善当地的公共设施，比如公园和图书馆。每个人都积极发表意见，希望为社区做出贡献。",
          "chineseIdea": "表达一个人积极参与社区事务，展现出对社会责任的承诺。",
          "sentenceWithBlank": "She is an @ @ who always participates in local events and volunteers for community projects.",
          "fullEnglishSentence": "She is an 「active citizen」 who always participates in local events and volunteers for community projects.",
          "chineseTranslation": "她是一个「积极的公民」，总是参与当地的活动并为社区项目做志愿者。",
          "chinglishFix": "Chinglish: She is a citizen who very active in community. Correct: She is an active citizen who participates enthusiastically in community activities."
        },
        {
          "scene": "在国际化的大学里，学生们来自世界各地，他们讨论如何在全球化的背景下为环境保护做出贡献。",
          "chineseIdea": "描述一个人关注全球问题，愿意为全人类的福祉努力。",
          "sentenceWithBlank": "As a @ @, he advocates for sustainable practices to address climate change.",
          "fullEnglishSentence": "As a 「global citizen」, he advocates for sustainable practices to address climate change.",
          "chineseTranslation": "作为一个「全球公民」，他倡导可持续的做法来应对气候变化。",
          "chinglishFix": "Chinglish: He is a world citizen who cares about environment. Correct: He is a global citizen who cares about environmental issues."
        }
      ]
    },
    {
      "meaning": "A resident or inhabitant of a particular place, often a city or town, without emphasis on legal status",
      "usage": "Used to describe someone who lives in a specific area, often in a more informal or community-focused context, without necessarily implying legal citizenship.",
      "collocations": ["ordinary citizen", "concerned citizen", "senior citizen"],
      "examples": [
        {
          "scene": "在一个小城镇的集市上，当地居民发现一条主要街道的路灯坏了，影响了夜间的安全。他们向市政府写信反映问题。",
          "chineseIdea": "表达普通居民对社区问题的关注和主动反馈。",
          "sentenceWithBlank": "An @ @ wrote a letter to the mayor about the broken streetlights.",
          "fullEnglishSentence": "An 「ordinary citizen」 wrote a letter to the mayor about the broken streetlights.",
          "chineseTranslation": "一个「普通公民」给市长写信反映路灯坏了的问题。",
          "chinglishFix": "Chinglish: A normal citizen complained the streetlight problem. Correct: An ordinary citizen reported the issue with the streetlights."
        },
        {
          "scene": "在一个城市的养老院里，志愿者组织了一场活动，为老年人提供免费的健康检查和娱乐节目。",
          "chineseIdea": "描述社区对老年居民的关怀和尊重。",
          "sentenceWithBlank": "The event was organized to support the @ @ in our community.",
          "fullEnglishSentence": "The event was organized to support the 「senior citizen」 in our community.",
          "chineseTranslation": "这场活动是为了支持我们社区的「老年公民」。",
          "chinglishFix": "Chelves for the elderly in our community. Correct: The event was organized to support the senior citizens in our community."
        }
      ]
    }
  ]
}
