{
  "word": "canteen",
  "definitions": [
    {
      "meaning": "A place in a school, workplace, or military base where meals or snacks are served or eaten",
      "usage": "Refers to a communal dining area where people gather to eat, often in an institutional setting like a school or factory. It can also imply a self-service or subsidized food service.",
      "collocations": ["school canteen", "staff canteen", "eat in the canteen"],
      "examples": [
        {
          "scene": "在一所中学里，学生们在午餐时间聚集在一个热闹的餐厅，里面有长桌和自助餐台，学生们排队买饭，之后找座位和朋友一起吃饭。",
          "chineseIdea": "学生们在午餐时间去一个固定的地方吃饭，这里是学校提供餐饮的地方，通常价格便宜且方便。",
          "sentenceWithBlank": "During lunch break, students flock to the @ @ to grab their meals.",
          "fullEnglishSentence": "During lunch break, students flock to the 「school canteen」 to grab their meals.",
          "chineseTranslation": "午餐休息时，学生们蜂拥而至到「学校餐厅」拿他们的饭菜。",
          "chinglishFix": "Chinglish: 'Students go to the school kitchen to eat lunch.' Correction: 'Students go to the school canteen to have lunch.' ('Kitchen' refers to a place for cooking, not dining.)"
        },
        {
          "scene": "在一间工厂里，工人们在轮班后去一个专门的区域吃午饭，这个区域有售卖热食的柜台和一些简单的桌椅，工人们在这里短暂休息。",
          "chineseIdea": "工人们在工作间隙去一个地方吃饭，这个地方是工厂为员工提供的用餐区域，通常提供简单的饭菜。",
          "sentenceWithBlank": "After their shift, workers head to the @ @ to have a quick meal.",
          "fullEnglishSentence": "After their shift, workers head to the 「staff canteen」 to have a quick meal.",
          "chineseTranslation": "轮班后，工人们前往「员工餐厅」吃一顿快餐。",
          "chinglishFix": "Chinglish: 'Workers go to the factory dining room for food.' Correction: 'Workers go to the staff canteen for a meal.' ('Dining room' is more formal and typically used for homes or upscale settings.)"
        }
      ]
    },
    {
      "meaning": "A small container used for carrying water or other liquids, often used by soldiers or hikers",
      "usage": "Refers to a portable flask or bottle, typically made of metal or plastic, designed for carrying drinking water or other liquids during outdoor activities or military operations.",
      "collocations": ["fill the canteen", "carry a canteen", "drink from the canteen"],
      "examples": [
        {
          "scene": "在一个徒步旅行活动中，旅行者们背着背包，穿越森林，每个人都带了一个金属水壶，挂在腰带上，随时可以喝水。",
          "chineseIdea": "徒步者携带一个便携的水容器，方便在户外活动时随时补充水分。",
          "sentenceWithBlank": "Before the hike, she made sure to @ @ @ with fresh water.",
          "fullEnglishSentence": "Before the hike, she made sure to 「fill the canteen」 with fresh water.",
          "chineseTranslation": "在徒步前，她确保「把水壶装满」新鲜水。",
          "chinglishFix": "Chinglish: 'She put water into the bottle before hiking.' Correction: 'She filled the canteen with water before hiking.' ('Bottle' is too generic; 'canteen' is specific to this context.)"
        },
        {
          "scene": "在一场军事演习中，士兵们在沙漠环境中行军，每个人腰间都挂着一个水壶，随时停下来喝水以保持体力。",
          "chineseIdea": "士兵在行军时携带一个水容器，方便在需要时喝水，尤其是在艰苦的环境中。",
          "sentenceWithBlank": "During the march, he paused to @ @ @ to stay hydrated.",
          "fullEnglishSentence": "During the march, he paused to 「drink from the canteen」 to stay hydrated.",
          "chineseTranslation": "在行军中，他停下来「从水壶里喝水」以保持水分。",
          "chinglishFix": "Chinglish: 'He drinks water from the water bottle during the march.' Correction: 'He drinks from the canteen during the march.' ('Water bottle' is less specific and less common in military contexts.)"
        }
      ]
    }
  ]
}
