{
  "word": "consequently",
  "definitions": [
    {
      "meaning": "作为结果，因此",
      "usage": "用作副词，表示某事是前述情况的直接结果，通常放在句首或句中，连接因果关系。",
      "collocations": ["as a result", "lead to", "result in"],
      "examples": [
        {
          "scene": "在一次重要的商务会议后，公司决定裁员以应对财务困难。",
          "chineseIdea": "由于公司业绩不佳，裁员成为了必然的结果。",
          "sentenceWithBlank": "@ @ @ of the company's poor performance, it had to lay off several employees.",
          "fullEnglishSentence": "「As a result」 of the company's poor performance, it consequently had to lay off several employees.",
          "chineseTranslation": "由于公司业绩不佳，「因此」不得不裁减了几名员工。",
          "chinglishFix": "典型中式英语：'Because company is not good, so it cut employees.' 纠正：'Due to the company's poor performance, it consequently laid off several employees.'"
        },
        {
          "scene": "学生因为没有认真复习，考试成绩很差，失去了奖学金。",
          "chineseIdea": "缺乏准备导致了不理想的结果。",
          "sentenceWithBlank": "Her lack of preparation @ @ a failing grade, and she lost her scholarship.",
          "fullEnglishSentence": "Her lack of preparation 「led to」 a failing grade, and she consequently lost her scholarship.",
          "chineseTranslation": "她缺乏准备「导致」了考试不及格，「因此」失去了奖学金。",
          "chinglishFix": "典型中式英语：'She didn't study, so she failed exam and no scholarship.' 纠正：'Her lack of preparation led to a failing grade, and she consequently lost her scholarship.'"
        }
      ]
    },
    {
      "meaning": "随后，紧接着",
      "usage": "用作副词，表示时间上的紧接后果或顺序，通常用于描述事件的自然发展。",
      "collocations": ["follow from", "stem from", "arise from"],
      "examples": [
        {
          "scene": "在一场激烈的辩论后，双方达成了妥协，并开始制定新政策。",
          "chineseIdea": "辩论的结果直接促成了后续的行动。",
          "sentenceWithBlank": "The heated debate @ @ a compromise, and new policies were drafted.",
          "fullEnglishSentence": "The heated debate 「followed from」 a compromise, and new policies were consequently drafted.",
          "chineseTranslation": "激烈的辩论「促成」了妥协，「随后」新政策被起草。",
          "chinglishFix": "典型中式英语：'Debate finished, so they make new policy.' 纠正：'The debate led to a compromise, and new policies were consequently drafted.'"
        },
        {
          "scene": "工厂因为设备故障停产，供应商不得不寻找其他替代方案。",
          "chineseIdea": "设备问题引发了后续的供应链调整。",
          "sentenceWithBlank": "The equipment failure @ @ a production halt, and suppliers had to find alternatives.",
          "fullEnglishSentence": "The equipment failure 「stemmed from」 a production halt, and suppliers consequently had to find alternatives.",
          "chineseTranslation": "设备故障「引发」了生产停止，「随后」供应商不得不寻找替代方案。",
          "chinglishFix": "典型中式英语：'Machine broken, so suppliers change.' 纠正：'The equipment failure caused a production halt, and suppliers consequently sought alternatives.'"
        }
      ]
    }
  ]
}
